[ItemDefs.ID_MO_HiddenJournals_Echo MissionItemDefinition]
UseFailureCharacterMessage="You must %s Use this article."
ItemName="Tanis ECHO device"
PickupMessage="you win %s"
UseFailureLevelMessage="You must be at least %d level to use this."
UseFailureConstraintsMessage="You cannot use this number."
NoManufacturerName="Minister"

[ItemDefs.ID_MO_HiddenJournals_Echo:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Tennis remembers her first week at the temple."
NoConstraintText=""
Suffix=""
Prefix=""

